Examinator/src/InformationRegisters/ИзбранноеПользователейСУЗ/ИзбранноеПользователейСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИзбранноеПользователейСУЗ</name>
  <attributes>
    <name>ДатаОтметки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭлементСодержания</name>
    <type>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ИзбранноеПользователейСУЗ/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Процедура ДобавитьУдалитьЭлементВИзбранном(Знач ЭлементСодержания, Знач Пользователь, Знач ПривилегированныйРежим=Ложь) Экспорт
	
	Если ПривилегированныйРежим Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;	
	
	Если ТипЗнч(ЭлементСодержания) <> Тип("СправочникСсылка.СодержаниеСУЗ") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЭлементСодержания) Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлементСодержания, "ЭтоГруппа") <> Ложь Тогда //Явно сравниваем, так как может быть Неопределено
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ИзбранноеПользователейСУЗ.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	НаборЗаписей.Отбор.ЭлементСодержания.Установить(ЭлементСодержания);
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		
		НоваяЗапись = НаборЗаписей.Добавить();
		
		НоваяЗапись.Пользователь = Пользователь;
		НоваяЗапись.ЭлементСодержания = ЭлементСодержания;
		НоваяЗапись.ДатаОтметки = ТекущаяДатаСеанса();
		
	Иначе
		
		НаборЗаписей.Очистить(); // Примечание: если запись уже есть, то она будет удалена.
		
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Функция ТаблицаИзбранного(Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзбранноеПользователейСУЗ.ЭлементСодержания
		|ИЗ
		|	РегистрСведений.ИзбранноеПользователейСУЗ КАК ИзбранноеПользователейСУЗ
		|ГДЕ
		|	ИзбранноеПользователейСУЗ.Пользователь = &Пользователь";

	Запрос.УстановитьПараметр("Пользователь", Пользователь);

	Результат = Запрос.Выполнить();

	Возврат Результат.Выгрузить();
	
КонецФункции

#КонецОбласти

#КонецЕсли
